{"posts":[{"id":"5ec55131-5ba0-4b66-b240-c1968967e12e","title":"Nvidia needs EU approval to buy AI startup Run:ai, regulators say","description":"BRUSSELS, Oct 31 (Reuters) - U.S. chipmaker Nvidia (NVDA.O), opens new tab will have to seek EU antitrust clearance for its proposed acquisition of AI startup Run:ai because it threatens competition in the markets where the companies operate, the European Commission said on Thursday.\nThe move by the EU antitrust enforcer may require Nvidia to offer concessions to secure its approval for the deal. Regulators on both sides of the Atlantic have recently stepped up their scrutiny of tech giants' acquisitions of start-ups on concerns they may shut down the potential rivals.\nNvidia announced the acquisition of Israeli firm Run:ai in April which will be bought for around $700 million according to a report by Tech Crunch.\nRun:ai's technology allows developers and teams to manage and optimize their artificial intelligence infrastructure.\nWhile the deal does not meet the EU turnover threshold requiring Nvidia to request EU approval, it was notified to the Italian competition agency which subsequently asked the EU watchdog to take up the case.","image":"https://www.reuters.com/resizer/v2/OAKGR57SABM5JHRLMTXXCKYXKQ.jpg?auth=b2fd8e10810a80628188ddb2dc6273ef0271e1d04bc129a7f83c71967a4f97c6&width=1080&quality=80","date":"2024-11-25"},{"id":"0a815154-97e2-4c6c-8ec9-0429c89a9e5f","title":"OpenAI adds new search function to ChatGPT","description":"Oct 31 (Reuters) - OpenAI on Thursday added a set of new search functions to its popular large language model ChatGPT, opting to integrate the feature into the chatbot instead of launching a separate product.\nThe AI giant is venturing into a territory long dominated by Alphabet's (GOOGL.O), opens new tab Google, also placing it in competition with OpenAI-backer Microsoft's (MSFT.O), opens new tab Bing and emerging services such as Perplexity — a search-focused AI chatbot firm backed by Amazon (AMZN.O), opens new tab founder Jeff Bezos and semiconductor giant Nvidia (NVDA.O), opens new tab.\nOpenAI said that ChatGPT search will choose to dig the web based on what users ask and will provide fast, timely answers with links to relevant web sources.\n\"ChatGPT search leverages third-party search providers, as well as content provided directly by our partners, to provide the information users are looking for,\" OpenAI said in a blog post.\nThe search model is a fine-tuned version of GPT-4o, the startup said, adding that all ChatGPT Plus and Team users will have access to it on Thursday.","image":"https://www.reuters.com/resizer/v2/LDWBP4VJINMFXKP5UEB2D2ZHVM.jpg?auth=cd9b07d6d97349fbde831a65eb334fc3aed6e7a37490cdc7c469fcce0b21340d&width=1080&quality=80","date":"2024-11-18"},{"id":"e08c0dbd-2c81-4b93-9d1a-8ea9df4f0ba7","title":"Monkeys will never type Shakespeare, study finds","description":"Two Australian mathematicians say they have debunked an old adage, that if given an infinite amount of time, a monkey pressing keys on a typewriter would eventually write the complete works of William Shakespeare.\n\nKnown as the \"infinite monkey theorem\", the mathematical thought-experiment has long been used to explain the principles of probability and randomness.\n\nHowever, a new peer-reviewed study led by Sydney-based researchers Stephen Woodcock and Jay Falletta has found that the time it would take for a typing monkey to replicate Shakespeare's plays, sonnets and poems would be longer than the lifespan of our universe.\n\nWhich means that while mathematically true, the theorem is \"misleading\", they say.\n\nAs well as looking at the abilities of a single monkey, the study also did a series of calculations based on the current global population of chimpanzees, which is roughly 200,000.","image":"https://ichef.bbci.co.uk/news/1024/cpsprodpb/b230/live/a0f27380-97ea-11ef-a86a-53838554c3d1.jpg.webp","date":"2024-11-01"}],"users":[{"email":"NMT@gmail.com","password":"$2a$12$WruTPcqhO0RayIvRUGrVzeugARSULxhR9vm1FNOkRtP.SLnpNoSLO","id":"9abb24cd-eb6c-431c-a7fd-5cc3c0743712"}]}